In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('raw_oecd_central_government_corporate_tax_2001_2022.csv')

In [3]:
df.head()

,COU,Country,CORP_TAX,Corporate income tax rate,YEA,Year,Unit Code,Unit,PowerCode Code,PowerCode,Reference Period Code,Reference Period,Value,Flag Codes,Flags
0,SVK,Slovak Republic,CIT_RATE,Corporate income tax rate,2001,2001,PC,Percentage,0,Units,NaN,NaN,29.0,NaN,NaN
1,SVK,Slovak Republic,CIT_RATE,Corporate income tax rate,2002,2002,PC,Percentage,0,Units,NaN,NaN,25.0,NaN,NaN
2,SVK,Slovak Republic,CIT_RATE,Corporate income tax rate,2003,2003,PC,Percentage,0,Units,NaN,NaN,25.0,NaN,NaN
3,SVK,Slovak Republic,CIT_RATE,Corporate income tax rate,2004,2004,PC,Percentage,0,Units,NaN,NaN,19.0,NaN,NaN
4,SVK,Slovak Republic,CIT_RATE,Corporate income tax rate,2005,2005,PC,Percentage,0,Units,NaN,NaN,19.0,NaN,NaN

In [4]:
df.isna().sum()

COU                             0
Country                         0
CORP_TAX                        0
Corporate income tax rate       0
YEA                             0
Year                            0
Unit Code                       0
Unit                            0
PowerCode Code                  0
PowerCode                       0
Reference Period Code        2592
Reference Period             2592
Value                           0
Flag Codes                   2592
Flags                        2592
dtype: int64

In [5]:
df = df.drop('CORP_TAX', axis=1).drop('Corporate income tax rate', axis=1).drop('YEA', axis=1).drop('Unit Code', axis=1).drop('Unit', axis=1).drop('PowerCode Code', axis=1).drop('PowerCode', axis=1)

In [6]:
df = df.drop('Reference Period Code', axis=1).drop('Reference Period', axis=1).drop('Flag Codes', axis=1).drop('Flags', axis=1)

In [7]:
df.head()

   COU          Country  Year  Value
0  SVK  Slovak Republic  2001   29.0
1  SVK  Slovak Republic  2002   25.0
2  SVK  Slovak Republic  2003   25.0
3  SVK  Slovak Republic  2004   19.0
4  SVK  Slovak Republic  2005   19.0

In [8]:
df.rename(columns={'COU': 'ISO_code_alpha3', 'Value': 'Corporate tax (OECD)'}, inplace=True)

In [9]:
df.insert(loc=0, column='id', value=(df['ISO_code_alpha3'] + '-' + df['Year'].astype(str)))

In [10]:
df.head()

         id ISO_code_alpha3          Country  Year  Corporate tax (OECD)
0  SVK-2001             SVK  Slovak Republic  2001                  29.0
1  SVK-2002             SVK  Slovak Republic  2002                  25.0
2  SVK-2003             SVK  Slovak Republic  2003                  25.0
3  SVK-2004             SVK  Slovak Republic  2004                  19.0
4  SVK-2005             SVK  Slovak Republic  2005                  19.0

In [11]:
df.isna().sum()

id                      0
ISO_code_alpha3         0
Country                 0
Year                    0
Corporate tax (OECD)    0
dtype: int64

In [12]:
len(df)

2592

Countries in this df with 0% corporate income tax.

In [13]:
df[df['Corporate tax (OECD)']==0]['Country'].unique()

array(['Jersey', 'Andorra', 'Bahrain', 'Guernsey', 'United Arab Emirates',
       'Cayman Islands', 'Bermuda', 'Anguilla', 'Maldives',
       'British Virgin Islands', 'Bahamas', 'Turks and Caicos Islands',
       'Isle of Man', 'Belize', 'Cook Islands'], dtype=object)

In [15]:
df.to_csv('prepared_oecd_central_government_corporate_tax_2001_2022.csv', index=False)